Repository: 84000/data-translation-memory
Catalog: toh317_84000-distinctly-ascertaining-the-meanings.tmx
Source language: bo
Languages: en

source: སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་འཕགས་པའི་བདེན་པ་དང་། སྡུག་བསྔལ་འགོག་པ་འཕགས་པའི་བདེན་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་འཕགས་པའི་བདེན་པའོ།
en: They are the noble ones’ truth of suffering, the noble ones’ truth of the arising of suffering, the noble ones’ truth of the cessation of suffering, and the noble ones’ truth of the path that leads to the cessation of suffering.

source: །སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་གང་ཞེ་ན།
en: “What is the noble ones’ truth of suffering?

source: སྐྱེ་བའི་སྡུག་བསྔལ་དང་། རྒ་བའི་སྡུག་བསྔལ་དང་། ན་བའི་སྡུག་བསྔལ་དང་། འཆི་བའི་སྡུག་བསྔལ་དང་། སྡུག་པ་དང་བྲལ་བའི་སྡུག་བསྔལ་དང་། མི་སྡུག་པ་དང་ཕྲད་པའི་སྡུག་བསྔལ་དང་། གང་འདོད་པ་བཅོལ་ཏེ་མ་རྙེད་པ་དེ་ཡང་སྡུག་བསྔལ་ལོ།
en: Birth is suffering, decay is suffering, illness is suffering, death is suffering, separation from what one likes is suffering, conjunction with what one dislikes is suffering, and failing to obtain what one wants despite searching for it is suffering;

source: །མདོར་བསྡུས་ན་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་དག་ནི་སྡུག་བསྔལ་ཡིན་ཏེ།
en: in brief, the five aggregates of clinging are suffering.

source: འདི་ནི་སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ།
en: This is explained as the noble ones’ truth of suffering.

source: །སྡུག་བསྔལ་ཀུན་འབྱུང་བ་འཕགས་པའི་བདེན་པ་གང་ཞེ་ན།
en: “What is the noble ones’ truth of the arising of suffering?

source: གང་འདི་ཡང་འབྱུང་བ་པའི་སྲེད་པ་དང་། དགའ་བའི་འདོད་ཆགས་དང་ལྡན་པ་དང་། དེ་དང་དེར་མངོན་པར་དགའ་བ་སྟེ།
en: It is craving that is conducive to a new existence and that is accompanied by rejoicing and attraction, furthermore delighting in this and that.

source: འདི་ནི་སྡུག་བསྔལ་ཀུན་འབྱུང་བ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ།
en: This is explained as the noble ones’ truth of the arising of suffering.

source: །སྡུག་བསྔལ་འགོག་པ་འཕགས་པའི་བདེན་པ་གང་ཞེ་ན།
en: “What is the noble ones’ truth of the cessation of suffering?

source: གང་ཡང་འབྱུང་བ་པའི་སྲེད་པ་དང་། དགའ་བའི་འདོད་ཆགས་དང་ལྡན་པ་དང་། དེ་དེ་དང་དེར་མངོན་པར་དགའ་བ་དེ་ཉིད་མ་ལུས་པར་སྤངས་པ་དང་། ངེས་པར་སྤངས་པ་དང་། བྱང་བར་གྱུར་པ་དང་། ཟད་པ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་། འགོག་པ་དང་། རྣམ་པར་ཞི་བ་དང་། ནུབ་པ་སྟེ།
en: It is the complete abandonment of, thorough relinquishment of, termination of, destruction of, nonattraction to, cessation of, pacification of, and disappearance of that very craving that is conducive to a new existence and that is accompanied by rejoicing and attraction, furthermore delighting in this and that.

source: འདི་ནི་སྡུག་བསྔལ་འགོག་པ་འཕགས་པའི་བདེན་པ་ཞེས་བྱའོ།
en: This is explained as the noble ones’ truth of the cessation of suffering.

source: །སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་འཕགས་པའི་བདེན་པ་གང་ཞེ་ན།
en: “What, then, is the noble ones’ truth of the path that leads to the cessation of suffering?

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟེ། འདི་ལྟ་སྟེ།
en: It is the noble path with eight parts:

source: ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏེ།
en: right view, right thinking, right speech, right activity, right livelihood, right effort, right mindfulness, and right samādhi.

source: འདི་ནི་སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་འཕགས་པའི་བདེན་པ་ཞེས་བྱ་སྟེ།
en: This is explained as the noble ones’ truth of the path that leads to the cessation of suffering.

source: འདི་དག་ནི་འཕགས་པའི་བདེན་པ་བཞིའོ། །དབང་པོ་ཉི་ཤུ་རྩ་གཉིས་གང་ཞེ་ན།
en: “These are the four truths of the noble ones. “Then, what are the twenty-two faculties?

source: མིག་གི་དབང་པོ་དང་། རྣ་བའི་དབང་པོ་དང་། སྣའི་དབང་པོ་དང་། ལྕེའི་དབང་པོ་དང་། ལུས་ཀྱི་དབང་པོ་དང་། ཡིད་ཀྱི་དབང་པོ་དང་། ཕོའི་དབང་པོ་དང་། མོའི་དབང་པོ་དང་། སྲོག་གི་དབང་པོ་དང་། སྡུག་བསྔལ་གྱི་དབང་པོ་དང་། བདེ་བའི་དབང་པོ་དང་། ཡིད་བདེ་བའི་དབང་པོ་དང་། ཡིད་མི་བདེ་བའི་དབང་པོ་དང་། བཏང་སྙོམས་ཀྱི་དབང་པོ་དང་། དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་དང་། མི་ཤེས་པ་ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་སྟེ།
en: They are the eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty, the thought faculty, the male faculty, the female faculty, the life faculty, the suffering faculty, the pleasure faculty, the mental well-being faculty, the mental anguish faculty, the neutrality faculty, the faith faculty, the heroism faculty, the mindfulness faculty, the samādhi faculty, the wisdom faculty, the ‘I will completely know what I don’t yet know’ faculty, the complete-knowledge faculty, and the ‘I have completely known’ faculty.

source: དགེ་སློང་དག་འདི་དག་ནི་དབང་པོ་ཉི་ཤུ་རྩ་གཉིས་སོ།
en: These, bhikṣus, are the twenty-two faculties.

source: །དེ་ལ་བསམ་གཏན་བཞི་གང་ཞེ་ན།
en: “Now, what are the four meditations?

source: དགེ་སློང་དག་འདི་ལ་དགེ་སློང་རྣམས་འདོད་པ་དག་ལས་དབེན་པ་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ་རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་གནས་པ་དང་། དེ་རྟོག་པ་དང་དཔྱོད་པ་དང་བྲལ་ཞིང་ནང་ཡོངས་སུ་དག་སྟེ་སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པར་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ།
en: “Here, bhikṣus, a bhikṣu isolated from desires, isolated from sinful, nonvirtuous dharmas, endowed with deliberation and analysis, and having the joy and pleasure born from isolation reaches and abides in the first meditation.

source: ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་རྫོགས་པར་བྱས་ཏེ་གནས་པ་དང་། དེ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་དྲན་པ་དང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ།
en: Due to the pacification of deliberations and analyses, due to being inwardly very well disposed, and due to the mind having a single texture, one reaches and abides in the second meditation, without deliberation or analysis and having the joy and pleasure born from samādhi. Due to nonattraction to joy, one abides with equanimity, and one is mindful, discerning, and feels pleasure in one’s body.

source: བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ་འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་གནས་པ་བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ། དགའ་བ་མེད་པ་བསམ་གཏན་གསུམ་པ་རྫོགས་པར་བྱས་ཏེ་གནས་པ་དང་། དེ་བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་། དྲན་པ་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་རྫོགས་པར་བྱས་ནས་གནས་པ་སྟེ།
en: Hence, the noble ones say, ‘equanimous and mindful, he abides in pleasure.’ Thus, one reaches and abides in the third meditation, which is without joy. Due to the abandonment of pleasure, due to the prior abandonment of pain, and due to the disappearance of mental well-being or anguish, one reaches and abides in the fourth meditation, which is without pleasure or pain and purified in terms of equanimity and mindfulness.

source: དགེ་སློང་དག་འདི་དག་ནི་བསམ་གཏན་བཞིའོ།
en: These, bhikṣus, are the four meditations.

source: །དེ་ལ་ཚངས་པའི་གནས་པ་བཞི་གང་ཞེ་ན།
en: “Now, what are the four Brahma abodes?

source: དགེ་སློང་དག་འདི་ལ་དགེ་སློང་གིས་བྱམས་པ་དང་ལྡན་པའི་སེམས་འཁོན་མེད་པ། འགྲན་ཟླ་མེད་པ། གནོད་པ་མེད་པ། ཡངས་པ་རྒྱ་ཆེན་པོར་གྱུར་པ། མི་གཉིས་པ།
en: Here, bhikṣus, a bhikṣu, with (1) a mind accompanied by friendliness, a mind without enmity, antagonism, or harming, an expansive, great mind without duality, without measure, and well cultivated, becomes intent upon one direction, fills it, reaches it, and abides thus. He then does the same for the second, the third, and the fourth direction and above, below, and across;

source: ཚད་མེད་པ་ཤིན་ཏུ་བསྒོམས་པས་ཕྱོགས་གཅིག་ཏུ་མོས་ཏེ་ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་ཤིང་དེ་བཞིན་དུ་གཉིས་པ་དང་། གསུམ་པ་དང་། དེ་བཞིན་དུ་བཞི་པ་དང་། བླ་དང་། འོག་དང་། ཐད་ཀར་རྣམ་པ་ཐམས་ཅད་དང་ལྡན་པའི་འཇིག་རྟེན་འདི་ཐམས་ཅད་དུ་བྱམས་པ་དང་ལྡན་པའི་སེམས་འཁོན་མེད་པ། འགྲན་ཟླ་མེད་པ། གནོད་པ་མེད་པ། ཡངས་པ། རྒྱ་ཆེན་པོར་གྱུར་པ། མི་གཉིས་པ། ཚད་མེད་པ་ཤིན་ཏུ་བསྒོམས་པས་མོས་ཏེ།
en: for this world on all sides and on all ends, he, with a mind accompanied by friendliness, a mind without enmity, antagonism, or harming, an expansive, great mind without duality, without measure, and well cultivated, becomes intent upon one direction, fills it, reaches it, and abides thus.

source: ཁྱབ་པར་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་པ་དང་། དེ་བཞིན་དུ་སྙིང་རྗེ་དང་ལྡན་པ་དང་། དགའ་བ་དང་ལྡན་པ་དང་། བཏང་སྙོམས་དང་ལྡན་པའི་སེམས་འཁོན་མེད་པ། འགྲན་ཟླ་མེད་པ། གནོད་པ་མེད་པ། ཡངས་པ་རྒྱ་ཆེན་པོར་གྱུར་པ། མི་གཉིས་པ་ཚད་མེད་པ་ཤིན་ཏུ་བསྒོམས་པས་མོས་པར་བྱས་ནས་ཁྱབ་པར་བྱས་ཏེ་རྫོགས་པར་བྱས་ནས་གནས་པ་སྟེ།
en: In the same way, with ( ) a mind accompanied by compassion, (3) a mind accompanied by rejoicing, and (4) a mind accompanied by equanimity, a mind without enmity, antagonism, or harming, an expansive, great mind without duality, without measure, and well cultivated, he becomes intent, fills, reaches, and abides thus.

source: འདི་དག་ནི་ཚངས་པའི་གནས་པ་བཞིའོ།
en: These are the four Brahma abodes.

source: །དེ་ལ་ལམ་བཞི་གང་ཞེ་ན།
en: “Then, what are the four courses?

source: མངོན་པར་ཤེས་པ་བུལ་ལ་དཀའ་བའི་ལམ་ཡང་ཡོད།
en: There is the course that is painful and that is slow in superior cognition.

source: མངོན་པར་ཤེས་པ་མྱུར་ལ་དཀའ་བའི་ལམ་ཡང་ཡོད།
en: There is the course that is painful and that is quick in superior cognition.

source: མངོན་པར་ཤེས་པ་བུལ་ལ་སླ་བའི་ལམ་ཡང་ཡོད།
en: There is the course that is pleasant and that is slow in superior cognition.

source: མངོན་པར་ཤེས་པ་མྱུར་ལ་སླ་བའི་ལམ་ཡང་ཡོད་དོ།
en: There is the course that is pleasant and that is quick in superior cognition.

source: །དེ་ལ་མངོན་པར་ཤེས་པ་བུལ་ལ་དཀའ་བའི་ལམ་གང་ཞེ་ན།
en: “Among those, what is the course that is painful and that is slow in superior cognition?

source: འདི་ལ་ཁ་ཅིག་རང་བཞིན་གྱིས་འདོད་ཆགས་ཀྱི་ཤས་ཆེ་བ་ཡིན། ཞེ་སྡང་གི་ཤས་ཆེ་བ་ཡིན། གཏི་མུག་གི་ཤས་ཆེ་བ་ཡིན་ཏེ།
en: Here someone has, by his very nature, intense attraction, intense aversion, and intense confusion.

source: དེ་ལ་འདོད་ཆགས་ཀྱི་ཤས་ཆེ་བས་འདོད་ཆགས་ལས་བྱུང་བའི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་རྒྱུན་མི་འཆད་པར་མྱོང་།
en: Due to his intense attraction, he constantly feels pain and mental anguish born of attraction;

source: ཞེ་སྡང་གི་ཤས་ཆེ་བས་ཞེ་སྡང་ལས་བྱུང་བའི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་རྒྱུན་མི་འཆད་པར་མྱོང་།
en: due to his intense aversion, he constantly feels pain and mental anguish born of aversion;

source: དེ་གཏི་མུག་གི་ཤས་ཆེ་བས་གཏི་མུག་ལས་བྱུང་བའི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་རྒྱུན་མི་འཆད་པར་མྱོང་བ་ཟག་པ་རྣམས་ཟད་པར་བྱ་བ་ལ་དེའི་འཇིག་རྟེན་ལས་འདས་པའི་དབང་པོ་ལྔ་པོ་འདི་དག་བུལ་བ་དང་། ཞན་པ་དང་། མི་རྣོ་བ་དང་། མྱུར་བར་འཇུག་པ་མ་ཡིན་ནོ།
en: due to his intense confusion, he constantly feels pain and mental anguish born of confusion. His five supramundane faculties are slow; they are weak and not intense, not carrying him swiftly toward the destruction of the fluxes.

source: །ལྔ་གང་ཞེ་ན།
en: What are the five?

source: འདི་ལྟ་སྟེ། དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོའོ།
en: They are the faith faculty, heroism faculty, mindfulness faculty, samādhi faculty, and wisdom faculty.

source: །དེ་འཇིག་རྟེན་ལས་འདས་པའི་དབང་པོ་ལྔ་པོ་འདི་དག་བུལ་བ་དང་། ཞན་པ་དང་། མི་ནོ་བ་དང་། མི་མྱུར་བའི་ཕྱིར་འདི་ལྟ་སྟེ། ཟག་པ་རྣམས་ཟད་པར་བྱ་བ་ལ་བར་ཆད་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་རེག་པ་བུལ་བ་ཉིད་དེ།
en: Thus, because these five supramundane faculties are slow, weak and not intense, and do not carry him swiftly, he will only slowly reach the samādhi that immediately precedes the destruction of the fluxes.

source: འདི་ནི་མངོན་པར་ཤེས་པ་བུལ་ལ་དཀའ་བའི་ལམ་མོ།
en: This is the course that is painful and that is slow in superior cognition.

source: །དེ་ལ་མངོན་པར་ཤེས་པ་མྱུར་ལ་དཀའ་བའི་ལམ་གང་ཞེ་ན།
en: “Among those, what is the course that is painful and that is quick in superior cognition?

source: དེ་འདོད་ཆགས་ཀྱི་ཤས་ཆེ་བས་འདོད་ཆགས་ལས་བྱུང་བའི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་རྒྱུན་མི་འཆད་པར་མྱོང་།
en: Due to his intense attraction, he constantly feels pain and mental anguish born of attraction;

source: གཏི་མུག་གི་ཤས་ཆེ་བས་གཏི་མུག་ལས་བྱུང་བའི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་རྒྱུན་མི་འཆད་པར་མྱོང་ཡང་དེའི་འཇིག་རྟེན་ལས་འདས་པའི་དབང་པོ་ལྔ་པོ་འདི་དག་ཆེ་བ་དང་། རྣོ་བ་དང་། མྱུར་བར་འཇུག་པ་ཡིན་ནོ།
en: due to his intense confusion, he constantly feels pain and mental anguish born of confusion. His five supramundane faculties are above measure, intense, and carry him swiftly.

source: །དེའི་འཇིག་རྟེན་ལས་འདས་པའི་དབང་པོ་ལྔ་པོ་འདི་དག་ཆེ་བ་དང་། རྣོ་བ་དང་། མྱུར་བར་འཇུག་པའི་ཕྱིར་འདི་ལྟ་སྟེ། ཟག་པ་རྣམས་ཟད་པར་བྱ་བ་ལ་བར་ཆད་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་རེག་པ་མྱུར་བ་ཉིད་དེ།
en: Thus, because these five supramundane faculties are above measure, intense, and carry him swiftly, he will very quickly reach the samādhi that immediately precedes the destruction of the fluxes.

source: འདི་ནི་མངོན་པར་ཤེས་པ་མྱུར་ལ་དཀའ་བའི་ལམ་མོ།
en: This is the course that is painful and that is quick in superior cognition.

source: །དེ་ལ་མངོན་པར་ཤེས་པ་བུལ་ལ་སླ་བའི་ལམ་གང་ཞེ་ན།
en: “Among those, what is the course that is pleasant and that is slow in superior cognition?

source: འདི་ལ་ཁ་ཅིག་རང་བཞིན་གྱིས་འདོད་ཆགས་ཀྱི་ཤས་ཆུང་བ་དང་། ཞེ་སྡང་གི་ཤས་ཆུང་བ་དང་། གཏི་མུག་གི་ཤས་ཆུང་བ་ཡིན་ཏེ།
en: Here someone has, by his very nature, little attraction, little aversion, and little confusion.

source: འདོད་ཆགས་ཀྱི་ཤས་ཆུང་བས་འདོད་ཆགས་ལས་བྱུང་བའི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་རྒྱུན་མི་འཆད་པར་མྱོང་བ་མ་ཡིན།
en: Having little attraction, he does not constantly feel pain and mental anguish born of attraction;

source: ཞེ་སྡང་གི་ཤས་ཆུང་བས་ཞེ་སྡང་ལས་བྱུང་བའི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་རྒྱུན་མི་འཆད་པར་མྱོང་བ་མ་ཡིན།
en: having little aversion, he does not constantly feel pain and mental anguish born of aversion;

source: གཏི་མུག་གི་ཤས་ཆུང་བས་གཏི་མུག་ལས་བྱུང་བའི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་རྒྱུན་མི་འཆད་པར་མྱོང་བ་མ་ཡིན་ཡང་དེའི་འཇིག་རྟེན་ལས་འདས་པའི་དབང་པོ་ལྔ་པོ་འདི་དག་བུལ་བ་དང་། ཞན་པ་དང་། མི་རྣོ་བ་དང་། མྱུར་བར་འཇུག་པ་མ་ཡིན་ནོ།
en: having little confusion, he does not constantly feel pain and mental anguish born of confusion. His five supramundane faculties are slow; they are weak and not intense, not carrying him swiftly toward the destruction of the fluxes.

source: །དེ་དབང་པོ་ལྔ་པོ་འདི་དག་བུལ་བ་དང་། ཞན་པ་དང་། མི་རྣོ་བ་དང་། འཇུག་པ་མི་མྱུར་བའི་ཕྱིར་འདི་ལྟ་སྟེ། ཟག་པ་རྣམས་ཟད་པར་བྱ་བ་ལ་བར་ཆད་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་རེག་པ་བུལ་བ་ཉིད་དེ།
en: Thus, because these five supramundane faculties are slow, weak and not intense, and do not carry him swiftly, he will only slowly reach the samādhi that immediately precedes the destruction of the fluxes.

source: །འདི་ནི་མངོན་པར་ཤེས་པ་བུལ་ལ་སླ་བའི་ལམ་མོ།
en: This is the course that is pleasant and that is slow in superior cognition.

source: །དེ་ལ་མངོན་པར་ཤེས་པ་མྱུར་ལ་སླ་བའི་ལམ་གང་ཞེ་ན།
en: “Among those, what is the course that is pleasant and that is quick in superior cognition?

source: འདི་ལ་ཁ་ཅིག་རང་བཞིན་གྱིས་འདོད་ཆགས་ཀྱི་ཤས་ཆུང་བ་ཡིན། ཞེ་སྡང་གི་ཤས་ཆུང་བ་ཡིན། གཏི་མུག་གི་ཤས་ཆུང་བ་ཡིན་ཏེ།
en: Here someone has, by his very nature, little attraction, little aversion, and little confusion.

source: དེ་འདོད་ཆགས་ཀྱི་ཤས་ཆུང་བས་འདོད་ཆགས་ལས་བྱུང་བའི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་རྒྱུན་མི་འཆད་པར་མྱོང་བ་མ་ཡིན།
en: Having little attraction, he does not constantly feel pain and mental anguish born of attraction;

source: གཏི་མུག་གི་ཤས་ཆུང་བས་གཏི་མུག་ལས་བྱུང་བའི་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་རྒྱུན་མི་འཆད་པར་ཡང་མྱོང་བ་མ་ཡིན་ལ་དེའི་འཇིག་རྟེན་ལས་འདས་པའི་དབང་པོ་ལྔ་པོ་འདི་དག་ཀྱང་ཆེ་བ་དང་། རྣོ་བ་དང་། མྱུར་བར་འཇུག་པ་ཡིན་ནོ།
en: having little confusion, he does not constantly feel pain and mental anguish born of confusion. His five supramundane faculties are above measure, intense, and carry him swiftly.

source: །དེ་འཇིག་རྟེན་ལས་འདས་པའི་དབང་པོ་ལྔ་པོ་དེ་དག་ཆེ་བ་དང་། རྣོ་བ་དང་། མྱུར་བར་འཇུག་པའི་ཕྱིར་འདི་ལྟ་སྟེ། ཟག་པ་རྣམས་ཟད་པར་བྱ་བ་ལ་བར་ཆད་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་རེག་པ་མྱུར་བ་ཉིད་དེ།
en: Thus, because these five supramundane faculties are above measure, intense, and carry him swiftly, he will very quickly reach the samādhi that immediately precedes the destruction of the fluxes.

source: འདི་ནི་མངོན་པར་ཤེས་པ་མྱུར་ལ་སླ་བའི་ལམ་སྟེ།
en: This is the course that is pleasant and that is quick in superior cognition.

source: འདི་དག་ནི་ལམ་བཞིའོ།
en: “These are the four courses.

source: །འདི་ལ་ཏིང་ངེ་འཛིན་བསྒོམ་པ་བཞི་གང་ཞེ་ན།
en: “Now, what are the four cultivations of samādhi?

source: དགེ་སློང་དག་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་འདོད་ཆགས་སྤོང་བར་འགྱུར་བ་ཡང་ཡོད།
en: There is, bhikṣus, a cultivation of samādhi that, once it is practiced, cultivated, and repeated, brings about the abandonment of attraction.

source: ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་མཐོང་བའི་ཆོས་ལ་བདེ་བར་གནས་པར་འགྱུར་བ་ཡང་ཡོད།
en: There is a cultivation of samādhi that, once it is practiced, cultivated, and repeated, brings about a pleasant abiding in this very life.

source: ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་ཡེ་ཤེས་མཐོང་བ་འཐོབ་པར་འགྱུར་བ་ཡང་ཡོད།
en: There is a cultivation of samādhi that, once it is practiced, cultivated, and repeated, brings about the obtainment of the vision of awareness.

source: ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་ཤེས་རབ་འཐོབ་པར་འགྱུར་བ་ཡང་ཡོད་དོ། །དེ་ལ་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་འདོད་ཆགས་སྤོང་བར་འགྱུར་བ་གང་ཞེ་ན།
en: There is a cultivation of samādhi that, once it is practiced, cultivated, and repeated, brings about the obtainment of wisdom.

source: དགེ་སློང་དག་འདི་ལ་དགེ་སློང་དགོན་པ་ན་འདུག་ཀྱང་རུང་། ཤིང་དྲུང་ན་འདུག་ཀྱང་རུང་། ཁང་སྟོང་ན་འདུག་ཀྱང་རུང་སྟེ། ལུས་འདི་ཉིད་ལ་འོག་གི་རྐང་མཐིལ་ཡན་ཅད་སྐྲ་དང་། གླད་པ་ལ་ཐུག་གི་བར་དུ་མི་གཙང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གང་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་སོ་སོར་རྟོག་སྟེ། ལུས་འདི་ལ་ཡོད་པ་ནི་སྐྲ་དང་། ཁ་སྤུ་དང་། སོ་དང་། སེན་མོ་དང་རྡུལ་དང་། དྲི་མ་དང་། པགས་པ་དང་། ཤ་དང་། རུས་པ་དང་། རྒྱུས་པ་དང་། རྩ་དང་། མཁལ་མ་དང་། སྙིང་དང་། གློ་བ་དང་། མཆིན་པ་དང་། ཕོ་བ་དང་། ལོང་ཀ་དང་། རྒྱུ་མ་དང་། གཉེ་མ་དང་། ལྒང་པ་དང་། མཆེར་པ་དང་། ཕྱི་ས་དང་། མཆི་མ་དང་། རྔུལ་དང་། ངར་སྣབས་དང་། མཆིལ་མ་དང་། ཞག་དང་། ཆུ་སེར་དང་། རྐང་དང་། ཚིལ་དང་། རྣག་དང་། བད་ཀན་དང་། མཁྲིས་པ་དང་། ཁྲག་དང་། གླད་པ་དང་། གླད་རྒྱས་དང་། གཅིན་དང་། མི་གཙང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གང་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་སོ་སོར་རྟོག་གོ།
en: “Among those, what is the cultivation of samādhi that, once practiced, cultivated, and repeated, brings about the abandonment of desirous attraction ? Here, bhikṣus, a bhikṣu, having gone to the forest, to the root of some tree, or to an empty house, observes this very body as it is, upwards from the soles of the feet and downwards from the hair and head, in its entirety, to be full of many types of impurities: ‘In this body there are hairs of the head, body hairs, teeth, nails, dirt, filth, skin, flesh, bones, sinews, channels, kidneys, heart, lungs, liver, stomach for the raw, stomach for the ripe, entrails, mesentery, bladder, spleen, excrement, tears, sweat, snot, spit, grease, fluid, marrow, fat, pus, phlegm, bile, blood, head, head membrane, and urine.’ Thus, he observes it to be full of many types of impurities, as it is.

source: །དགེ་སློང་དག་འདི་ལྟ་སྟེ། དཔེར་ན་འབྲུ་རྣམ་པ་སྣ་ཚོགས་འདི་ལྟ་སྟེ། འབྲས་སཱ་ལུ་དང་། འབྲུ་དང་། ནས་དང་། གྲོ་དང་། མོན་སྲན་གྲེའུ་དང་། མོན་སྲན་སྡེའུ་དང་། རྒྱ་སྲན་དང་། འབྲས་ནི་སྤ་བ་དང་། སྲན་ཆུང་དང་། མོན་སྲན་ན་གུ་དང་། ཏིལ་དང་། འབྲས་དྲུས་པ་དང་། ཡུངས་ཀར་གྱིས་གང་བའི་སྦྱང་ཞིག་ཁ་གཉིས་ཕྱེ་བ་དེ་ལ་མིག་དང་ལྡན་པའི་མི་ཞིག་གིས་བླུག་སྟེ་སོ་སོར་བརྟགས་ན་འདི་དག་ནི་འབྲས་སཱ་ལུའོ། །འདི་དག་ནི་འབྲས་སོ། །འདི་དག་ནི་ནས་སོ། །འདི་དག་ནི་གྲོའོ། །འདི་དག་ནི་མོན་སྲན་གྲེའུའོ། །འདི་དག་ནི་མོན་སྲན་སྡེའུ་འོ། །འདི་དག་ནི་རྒྱ་སྲན་ནོ། །འདི་དག་ནི་འབྲས་ནི་སྤ་བའོ། །འདི་དག་ནི་སྲན་ཆུང་ངོ་། །འདི་དག་ནི་མོན་སྲན་ན་གུའོ། །འདི་དག་ནི་ཏིལ་ལོ། །འདི་དག་ནི་འབྲས་དྲུས་པའོ། །འདི་དག་ནི་ཡུངས་ཀར་རོ་ཞེས་བྱ་བར་ཤེས་སོ། །དགེ་སློང་དག་དེ་བཞིན་དུ་དགེ་སློང་དགོན་པ་ན་འདུག་ཀྱང་རུང་། ཤིང་དྲུང་ན་འདུག་ཀྱང་རུང་། ཁང་སྟོང་ན་འདུག་ཀྱང་རུང་སྟེ། ལུས་འདི་ཉིད་ལ་འོག་གི་རྐང་མཐིལ་ཡན་ཅད་གླད་པ་ལ་ཐུག་གི་བར་དུ་སྔ་མ་བཞིན་དུ་གླད་པ་དང་། གླད་རྒྱས་དང་། གཅིན་དང་། མི་གཙང་བ་སྣ་ཚོགས་ཀྱིས་གང་བར་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་དུ་སོ་སོར་རྟོག་སྟེ།
en: “Just as, bhikṣus, when there is a granary with its doors open on both sides and full of many types of grains such as śāli rice, grain, barley, wheat, beans, lentils, horse gram, corn, split red lentils, mat beans, sesame, millet, and white mustard seeds, any person with eyes who looks at all that will know ‘This is śāli rice, this is rice, this is barley, this is wheat, these are beans, these are lentils, this is horse gram, this is corn, these are split red lentils, these are mat beans, this is sesame, this is millet, these are white mustard seeds.’ In the same way, bhikṣus, a bhikṣu, having gone to the forest, or to the root of some tree, or to an empty house, observes this very body as it is, upwards from the soles of the feet and downwards from the hair and head, in its entirety, to be full of many types of impurities, as before up to head, head membrane, and urine. This, bhikṣus, is the cultivation of samādhi that, once practiced, cultivated, and repeated, brings about the abandonment of desirous attraction

source: འདི་ནི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་འདོད་ཆགས་སྤང་བར་འགྱུར་རོ། །དགེ་སློང་དག་དེ་ལ་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་མཐོང་བའི་ཆོས་ལ་བདེ་བར་གནས་པར་འགྱུར་བ་གང་ཞེ་ན། དགེ་སློང་དག་འདི་ལ་དགེ་སློང་དགོན་པ་ན་འདུག་ཀྱང་རུང་། ཤིང་དྲུང་ན་འདུག་ཀྱང་རུང་། ཁང་སྟོང་ན་འདུག་ཀྱང་རུང་སྟེ། དབེན་པའི་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བས་རང་གི་ལུས་འདི་ཉིད་མཉེན་པར་བྱེད། ཡོངས་སུ་མཉེན་པར་བྱེད། ཡོངས་སུ་ཁྱབ་པར་བྱེད། ཡོངས་སུ་ཚིམ་པར་བྱེད། ཀུན་ཏུ་རྒྱས་པར་བྱེད་པ་སྟེ། འདི་ལྟ་སྟེ། དབེན་པའི་ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བས་དེའི་རང་གི་ནང་གི་ལུས་ཐམས་ཅད་ལ་མ་ཁྱབ་པའམ་ཁྱབ་པར་མ་གྱུར་པ་མེད་དོ། །དགེ་སློང་དག་འདི་ལྟ་སྟེ། དཔེར་ན་མེ་ཏོག་ཨུད་པ་ལའམ། པད་མའམ། ཀུ་མུ་དའམ། པད་མ་དཀར་པོ་ཡང་རུང་སྟེ། ཆུ་ནས་སྐྱེས་པ་ཆུར་བྱིང་བ་དེ་དག་ཐམས་ཅད་ནི་བསིལ་བའི་ཆུས་མཉེན་པར་བྱས་པ། ཡོངས་སུ་ཁྱབ་པར་བྱས་པ། ཡོངས་སུ་ཚིམ་པར་བྱས་པ།
en: “Among those, bhikṣus, what is the cultivation of samādhi that, once it is practiced, cultivated, and repeated, brings about a pleasant abiding in this very life?

source: ཀུན་ཏུ་རྒྱས་པར་བྱས་པ་དག་གོ། །དགེ་སློང་དག་དེ་བཞིན་དུ་དགེ་སློང་དགོན་པ་ན་འདུག་ཀྱང་རུང་། ཤིང་དྲུང་ན་འདུག་ཀྱང་རུང་། ཁང་སྟོང་ན་འདུག་ཀྱང་རུང་སྟེ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བས་རང་གི་ནང་གི་ལུས་འདི་མཉེན་པར་བྱེད། ཡོངས་སུ་མཉེན་པར་བྱེད། ཡོངས་སུ་ཁྱབ་པར་བྱེད། ཡོངས་སུ་ཚིམ་པར་བྱེད། ཀུན་ཏུ་རྒྱས་པར་བྱེད་དེ། འདི་ལྟ་སྟེ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བས་དེའི་ནང་གི་ལུས་ཐམས་ཅད་ལ་མ་ཁྱབ་པའམ། ཁྱབ་པར་མ་གྱུར་པ་མེད་དེ།
en: Here, bhikṣus, a bhikṣu, having gone to the forest, or to the root of some tree, or to an empty house, drenches wholly and thoroughly, completely fills, satiates, and suffuses this very body with the joy and pleasure born from the samādhi of isolation. There is no place in his body that is not filled and suffused with the joy and pleasure born from the samādhi of isolation. Just as, bhikṣus, water lilies, lotuses, joy lilies, or white lotuses, born in water and immersed in water, are wholly and thoroughly drenched, completely filled, satiated, and suffused by the cool water, in the very same way, bhikṣus, a bhikṣu, having gone to the forest, or to the root of some tree, or to an empty house, drenches wholly and thoroughly, completely fills, satiates, and suffuses this very body, inwardly, with the joy and pleasure born from samādhi. There is no place in his body that is not filled and suffused with the joy and pleasure born from samādhi. This is the cultivation of samādhi that, once it is practiced, cultivated, and repeated, brings about a pleasant abiding in this very life.

source: འདི་ནི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་མཐོང་བའི་ཆོས་ལ་བདེ་བར་གནས་པར་འགྱུར་བའོ། །དགེ་སློང་དག་དེ་ལ་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ཀུན་ཏུ་བསྟེན་ཏེ་བསྒོམས་ཤིང་མང་དུ་བྱས་ན་ཡེ་ཤེས་མཐོང་བ་འཐོབ་པར་འགྱུར་བ་གང་ཞེ་ན།
en: “Among those, bhikṣus, what is the cultivation of samādhi that, once it is practiced, cultivated, and repeated, brings about the obtainment of the vision of awareness?

source: དགེ་སློང་དག་འདི་ལ་དགེ་སློང་གིས་སྣང་བའི་འདུ་ཤེས་ཤིན་ཏུ་ལེགས་པར་བཟུང་།
en: Here, bhikṣus, a bhikṣu has well and properly grasped the perception of light;

source: ལེགས་པར་ཡིད་ལ་བྱས། ལེགས་པར་རེག་པར་བྱས། ལེགས་པར་རྟོགས་པར་བྱས་ཏེ།
en: he has placed it well in the mind, practiced it well, and thoroughly penetrated it.
